app/views/users/show.html.erb

<ul>
<% current_user.books.each do | book| %>
---
SELECT "all_books".* FROM "all_books" WHERE "all_books"."user_id" = 1 AND "all_books"."book_id" = 1 LIMIT 1
SELECT "books".* FROM "books" INNER JOIN "all_books" ON "books"."id" = "all_books"."book_id" WHERE "all_books"."user_id" = 2