app/controllers/books_controller.rb

  def create
    book = Book.find_by_title_and_author(params[:title].chomp, params[:author].chomp)
    p params[:book]
    book.nil? ? book = Book.create(:title => params[:title], :author => params[:author]) : book
    if AllBook.find_by_book_id_and_user_id(book.id, current_user.id).nil?
---
SELECT "books".* FROM "books" WHERE "books"."title" IN ('First Book') AND "books"."author" IN ('me') LIMIT 1
INSERT INTO "all_books" ("book_id", "created_at", "rating", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["book_id", 1], ["created_at", Wed, 10 Jul 2013 18:17:33 UTC +00:00], ["rating", 5], ["updated_at", Wed, 10 Jul 2013 18:17:33 UTC +00:00], ["user_id", 1]]
INSERT INTO "books" ("author", "created_at", "rating", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "this"], ["created_at", Tue, 09 Jul 2013 22:29:53 UTC +00:00], ["rating", nil], ["title", "Testing"], ["updated_at", Tue, 09 Jul 2013 22:29:53 UTC +00:00]]
SELECT "all_books".* FROM "all_books" WHERE "all_books"."book_id" = 9 AND "all_books"."user_id" = 1 LIMIT 1
SELECT "books".* FROM "books" WHERE "books"."title" IN ('First Book') LIMIT 1

  def destroy
    all_book = AllBook.find_by_book_id_and_user_id(params[:id], current_user.id)
    all_book.destroy
---
SELECT "all_books".* FROM "all_books" WHERE "all_books"."book_id" = 8 AND "all_books"."user_id" = 1 LIMIT 1
DELETE FROM "all_books" WHERE "all_books"."id" = ?  [["id", 8]]