app/controllers/users_controller.rb

  def create
    user = User.new(params[:user])
    if user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1